<h1>Fichier Aide de la Console Bear Altimeter</h1>
<p>Ceci est une aide rapide pour utilser votre console Bear altimeter sur Android. La console Android est tr&egrave;s pratique &agrave; utiliser pour reconfigurer votre altimètre lorsque vous êtes sur le terrain.</p>
<p>Tout d'abord vous devez vous assurer que votre altim&egrave;tre est compatible (c'est &agrave; dire que le bon firmware a &eacute;t&eacute; charg&eacute;).</p>
<p>Ensuite assurez vous que le module bluetooth est connect&eacute; &agrave; l'altim&egrave;tre.&nbsp;</p>
<p>Puis vous devez aller dans la configuration de votre appareil Android et dans&nbsp;la configuration bluetooth chercher les module bluetooth HC-05, HC-06 ou HC-07.</p>
<p>Lorsque vous l'avez trouv&eacute; entrez le code pour associer le module. Le code par d&egrave;faut est 1234.</p>
<p><span style="color: #ff0000;"><strong>!!! ATTENTION&nbsp;!!!!</strong></span></p>
<p><span style="color: #ff0000;"><strong>Il est souhaitable de nommer clairement chaque adaptateur bluetooth sur votre t&eacute;l&eacute;phone de mani&egrave;re &agrave; vous assurer que vous configurez le bon altim&egrave;tre.&nbsp;</strong></span></p>
<p>Ensuite allumer l'altim&egrave;tre et attendre jusqu'&agrave; ce qu'il bip la&nbsp;continuit&eacute;.</p>
<p>Puis d&eacute;marrer l'application sur votre appareil Android, cliquer sur montrer les p&eacute;riph&eacute;riques et choisissez le module HC-05 ou HC-06. L'application tente ensuite de se connecter &agrave; l'altim&egrave;tre.</p>
<p>Si le message connect&eacute; apparait, cela veut dire que vous êtes connect&eacute; et que vous pouvez utiliser la Console pour configurer votre &nbsp;altim&egrave;tre ou lire vos vols. Si cela n'arrive pas &agrave; se connecter assurez vous que vous avez selectionn&eacute; le bon module bluetooth ou que l'altim&egrave;tre est sous tension.</p>
<h2>Utilisation de la console altim&egrave;tre</h2>
<h3>Ecran principal de l'altim&egrave;tre</h3>
<p>Sur l'&eacute;cran principal vous avez un certain nombre de boutons, d&eacute;crivons les.&nbsp;</p>
<p><strong>[Configuration Altim&egrave;tre]</strong></p>
<p>Charge la configuration de l'altim&egrave;tre et vous permet de la modifier.</p>
<p><strong>[Chargement&nbsp;Vols]</strong></p>
<p>Charge la totalit&eacute; des vols que vous avez enregistr&eacute; et les affiche.</p>
<p><strong>[Télémetrie]</strong></p>
<p>Télémetrie de l'altimetre</p>
<p><strong>[Continuit&eacute; Marche/Arret]</strong></p>
<p>Allume ou &eacute;teind la continuit&eacute;.</p>
<p><strong>[Réinit Config]</strong></p>
<p>Donne la possibilit&eacute; de restaurer les param&egrave;tres d'usine de la configuration de l'altim&egrave;tre. Cela permet &eacute;galement d'effacer tous les vols.&nbsp;</p>
<p><strong>[Etat]</strong></p>
<p>Donne l'etat de l'altimétre, permet de tester les sorties</p>
<p><strong>[Flash Firmware]</strong></p>
<p>Permet de mettre à jour le firmware à l'aide d'un cable USB. Pour le moment uniquement les altimètres à base de ATMega328</p>
<p><strong>[Connexion/D&eacute;connexion]</strong></p>
<p>Se connecte ou d&eacute;connecte de l'altim&egrave;tre</p>
<h3>Menu de l'Ecran principal de l'altimètre</h3>
<p>Depuis le menu vous pouvez acc&egrave;der &agrave; ce fichier d'aide, un &eacute;cran &agrave; propos qui vous donnera des informations concernant la console et sa version . Vous avez &eacute;galement la possibilit&eacute; de changer l'apparance de l'application.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>La console est compatible avec les altimètres suivant:
    - Altiduo (version avec un Atmega328)
    - AltiMulti V1
    - AltiMulti V2
    - AltiServo
    - AltiGPS
    - AltiMulti SMT32</p>